[

	// Info according to Civilization Wiki and https://www.civfanatics.com/civ5/info/units/

	/* Ancient Era */
	{
		"name": "Worker",
		"unitType": "Civilian",
		"movement": 2,
		"uniques": ["Can build [Land] improvements on tiles"],
		"cost": 70,
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "" },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "" },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "" },
{ "text": "" },
{ "separator": true }
		]
	},
	{
		"name": "Settler",
		"unitType": "Civilian",
		"movement": 2,
		"cost": 106,
		"uniques": ["Founds a new city", "Excess Food converted to Production when under construction",
			"Requires at least [2] population"],
		"hurryCostModifier": 20,
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Settlers are used to found new cities. They can only be built in cities with a population of at least 2, and the city stops growing while producing the Settler." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "When possible, escort your settlers with military units as they are defenseless against Barbarians and other enemies. Remember that each new founded city affects your Happiness." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Among the earliest known cities are Jericho and Catalhöyük, dated to the 8th millenium BC. They were largely composed of domestic buildings, with little evidence of public buildings. During the 4th and 3rd millenium BC, a number of large cities flourished in Mesopotamia, India, China, and Egypt. These cities contained evidence of centralized rule and extensive public works."},
{ "text": "Later states would send out organized settlers to found colonies as their population grew. The first millenium BC saw an explosion of Greek and Phoenician colonies around the mediterranean, meanwhile the Han Chinese were colonizing the Ordos basin through the Tuntian system. The resulting colonies maintained diplomatic ties and some sense of identity with their mother cities." },
{ "text": "In modern usage, a settler refers to people from a sedentary culture who move into and start using land previously either unused or used by non-sedentary peoples. Various states have used settlers in more or less intentional manners to spread their culture and extend their rule over peripheral areas, such as the Arab Islamization of the Middle East, the American Manifest Destiny, or the English Plantations of Ireland." },
{ "separator": true }
		]
	},
	{
		"name": "Scout",
		"unitType": "Scout",
		"movement": 2,
		"strength": 5,
		"cost": 25,
		"obsoleteTech": "Scientific Theory",
		"uniques": ["May upgrade to [Archer] through ruins-like effects"],
		"promotions": ["Ignore terrain cost"],
		"attackSound": "nonmetalhit",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Early-game scouting unit. Scouts can cross difficult terrain without stopping and have access to special promotions that let them see further." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Use them to quickly find Ancient Ruins and City States, especially on starts with lots of rough terrain. When entering an Ancient Ruin, a Scout may be upgraded to an Archer, which then keeps its promotions, including the ability to ignore terrain costs." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Early exploration was directed at finding trade contacts, and rare resources to exploit. During the Mediterranean Bronze age, tin was a valuable commodity and the Phoenicians sent exlorers as far as Britain to source this metal." },
{ "text": "Scouting was also performed in a military context to get an assessment of enemy strengths and disposition. At the battle of Kadesh in 1274 BC, the Hittites were able to get an initial advantage over the Egyptians thanks to their better scouting." },
{ "separator": true }
		]
	},
	{
		"name": "Warrior",
		"unitType": "Sword",
		"movement": 2,
		"strength": 8,
		"cost": 40,
		"obsoleteTech": "Metal Casting",
		"upgradesTo": "Swordsman",
		"uniques" : ["May upgrade to [Spearman] through ruins-like effects"],
		"attackSound": "nonmetalhit",
        	"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{"text": "This is your basic, club-swinging fighter. The earliest military unit."},
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The only military unit that can be built at the start of the game. Used for early scouting, guarding workers and settlers from barbarian, and extorting tribute from City States." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Pre-historical warfare was centered around ambushing and raiding since it was not possible to effectively conquer foreign lands. The very first warriors were non-proffesionals, tribesmen gathered into ad hoc warbands. They might be armed with clubs, spears and slings."},
{ "separator": true }
		]
	},
	{
		"name": "Maori Warrior",
		"unitType": "Sword",
		"uniqueTo": "Polynesia",
		"replaces": "Warrior",
		"movement": 2,
		"strength": 8,
		"cost": 40,
		"obsoleteTech": "Metal Casting",
		"promotions": ["Haka War Dance"],
		"upgradesTo": "Swordsman",
		"attackSound": "nonmetalhit",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Polynesian Unique Unit comes with a unique promotion that is carried on through upgrades." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Since the Haka War Dance can not be gained in any other way, consider building several Maori Warriors and upgrading them throughout the game." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Maori are a Polynesian people that settled in Aotearoa (New Zealand) ca 1300 AD. They developed a fierce warrior culture with elaborately carved stone weaponry and impressive hillforts called 'pā'. Other distinctive features include the 'Haka' dance traditionally performed by warriors preparing for battle, and face-covering tattoos called 'Tā moko'." },
{ "text": "The British claimed and colonized New Zealand in the 18th century. This led to a brutal series of conflicts within the Maori known as the Musket Wars, followed by a series of long and drawn-out wars against the British. The Maori resisted the British fiercely despite being outnumbered and outgunned thanks in part to their use of pā forts, but in the end succumbed to the overwhelming force of an industrialized economy." },
{ "separator": true }
		]
	},
	{
		"name": "Jaguar",
		"unitType": "Sword",
		"uniqueTo": "Aztecs",
		"replaces": "Warrior",
		"movement": 2,
		"strength": 8,
		"cost": 40,
		"obsoleteTech": "Metal Casting",
		"uniques": ["+[33]% Strength in [Forest]", "+[33]% Strength in [Jungle]", "Heals [25] damage if it kills a unit"],
		"promotions": ["Woodsman"],
		"upgradesTo": "Swordsman",
		"attackSound": "nonmetalhit",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Aztec Unique Unit is able to move through Forests and Jungles unhindered and excels at fighting in those tiles." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Being able to move through Forests and Jungles unhindered means that the Aztecs are less reliant on Scouts for early exploration. The unique ability to heal after killing an enemy means the Jaguar can fight barbarians more frequently without having to retreat to heal." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Jaguar Warriors were an elite group of Aztec soldiers that wore jaguar skins into battle. They fought with the 'macuahuitl', a wooden club studded with obsidian blades, which the Spanish found were just as effective as steel swords when used properly. The macuahuitl also had a flat side which could be used to club an enemy without killing them, which was useful when taking captives." },
{ "text": "The Jaguar Warriors were often tasked with taking sacrificial captives which were important in the Aztec religion. To become a Jaguar Warrior, one had to capture a total of four live enemies."},
{ "separator": true }
		]
	},
	{
		"name": "Brute",
		"unitType": "Sword",
		"uniqueTo": "Barbarians",
		"replaces": "Warrior",
		"movement": 2,
		"strength": 8,
		"cost": 20,
		"obsoleteTech": "Metal Casting",
		"upgradesTo": "Swordsman",
		"attackSound": "nonmetalhit",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "An unwashed barbarian, aiming to tear down all that you have built!" },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "These units are only avaliable to the Barbarians, and to the Germans when capturing them. They are otherwise similar to the Warrior." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The word 'barbarian', meaning someone uncivilized or primitive, was first used by the ancient Greeks to refer to anyone not speaking Greek. The term eventually came to mean anyone from outside the broader Greco-Roman civilization. The term lives on in the name of the Berber people as well as 'the Barbary Coast'."},
{ "separator": true }
		]
	},
	{
		"name": "Archer",
		"unitType": "Archery",
		"movement": 2,
		"strength": 5,
		"rangedStrength": 7,
		"cost": 40,
		"requiredTech": "Archery",
		"obsoleteTech": "Construction",
		"upgradesTo": "Composite Bowman",
		"attackSound": "arrow",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "The Archer is the first ranged unit of the game, buildable in the Ancient Era." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Ranged units are vulnerable to attack from melee units. They are best used in combination with protecting melee units, or standing inside cities." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Arrowheads have been found from the Paleolithic age, possibly as early as 60,000 years ago. The earliest bows were used for hunting, but the bow as a weapon of war is perhaps as old as war itself. Several cave paintings in Spain from the Mesolithic depict battles between archers."},
{ "text": "Massed archers as a military unit were adopted by all the early urbanized civilizations, in Egypt, Mesopotamia, India, and China. Archery would remain an important part of militaries until the advent of gunpowder weapons." },
{ "separator": true }
		]
	},
	{
		"name": "Bowman",
		"unitType": "Archery",
		"movement": 2,
		"strength": 7,
		"rangedStrength": 9,
		"cost": 40,
		"requiredTech": "Archery",
		"obsoleteTech": "Machinery",
		"replaces": "Archer",
		"uniqueTo": "Babylon",
		"upgradesTo": "Composite Bowman",
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Babylonian Unique Unit has a higher attack and is also more resisten to melee attacks than the Archer which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Bowman is a formidable early game unit and together with the Walls of Babylon make the Babylonians very difficult to conquer in the early game." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "During the Neo-Babylonian empire of Nebuchadnezzar, a levy system was introduced where temples, cities and client kingdoms had to supply a certain number of armed men each. The majority of these were archers, and there are records of the extensive bowmaking facilities required to supply these soldiers with bows as well as 40-60 arrows each. The archer levies were divided by professions into units called 'Ešertu', which may have increased their cohesion."},
{ "separator": true }
		]
	},
	{
		"name": "Slinger",
		"unitType": "Archery",
		"uniqueTo": "Inca",
		"replaces": "Archer",
		"movement": 2,
		"strength": 4,
		"rangedStrength": 7,
		"cost": 40,
		"requiredTech": "Archery",
		"obsoleteTech": "Machinery",
		"upgradesTo": "Composite Bowman",
		"promotions": ["Slinger Withdraw"],
		"attackSound": "arrow",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Incan Unique Unit has the ability to withdraw when attacked by an enemy melee unit, making them less vulnerable to attack." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The unique ability to withdraw means that the Slinger is more able to operate alone than the basic Archer. Coupled with the Incan ability of moving quickly through Hills, this makes them useful for scouting or clearing barbarians in the early game." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The first slings appeared during the Neolithic and they have been used all over the world. The Andean slings were made from llama wool and dyed in bright contrasting colors. Incans used the sling extensively when fighting the Spanish and witnesses report that the Incan slings could break a sword in two pieces, or kill a horse with a single shot."},
{ "separator": true }
		]
	},
	/*
	{
		"name": "Archer",
		"unitType": "Archery",
		"uniqueTo": "Barbarians",
		"replaces": "Archer",
		"movement": 2,
		"strength": 4,
		"rangedStrength": 7,
		"cost": 40,
		"requiredTech": "Archery",
		"obsoleteTech": "Machinery",
		"upgradesTo": "Crossbowman",
		"attackSound": "arrow"
		// Barbarian unique archer. Has same icon and name but +1 rangedStrength (in vanilla) and slightly different 3d texture
	},
	*/
	{
		"name": "Work Boats",
		"unitType": "Civilian Water",
		"movement": 4,
		"cost": 30,
		"requiredTech": "Sailing",
		"uniques": ["Cannot enter ocean tiles until Astronomy", "May create improvements on water resources", "Uncapturable"],
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Needed to create improvements on water tiles. Unlike the Worker, creating an improvement with the Work Boats consumes the unit." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Create these whenever you need to improve a water resource. Remember that they, as well as the improvements they create, are vulnerable to Barbarian and enemy warships." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Fishing for food dates back at least 40,000 years. The earliest fishing tools were lines with bone hooks, but a major improvement came with the use of gillnets which allowed a large amount of fish to be caught in a very efficient manner. Seafood was a major part of the diet of all people living close to the sea." },
{ "text": "In the modern day, technologies such as sonar has improved the efficiency of fishing to such a degree that stocks are being depleted and there are often conflicts over fishing rights, such as the Cod War, Turbot War, Lobster War, and Scallop War." },
{ "separator": true }
		]
	},
	{
		"name": "Trireme",
		"unitType": "Melee Water",
		"movement": 4,
		"strength": 10,
		"cost": 45,
		"requiredTech": "Sailing",
		"uniques": ["Cannot enter ocean tiles"],
		"upgradesTo": "Caravel",
		"obsoleteTech": "Astronomy",
		"attackSound": "nonmetalhit",
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Ancient era warship. It can only travel close to the coast." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Trireme is useful for scouting on island starts, as well as protecting your fishing boats. Its limited mobility and low strength makes it of little use in attacking the enemy, although it can take cities that have been reduced by ranged attacks." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Trireme was a type of galley used in the Ancient Mediterranean, distinguished by having three banks of rowers. The rowers were free men and rowing was an important part of the military service expected in society. In battle, the main tactic used by triremes was ramming, in order to break the hull of the enemy ship." },
{ "text": "The trireme remained in use throughout Antiquity, but was eventually superseded by the larger Quinqueremes as well as the later Dromon."},
{ "separator": true }
		]
	},
	{
		"name": "Quinquereme",
		"unitType": "Melee Water",
		"uniqueTo": "Carthage",
		"replaces": "Trireme",
		"movement": 4,
		"strength": 13,
		"cost": 45,
		"requiredTech": "Sailing",
		"uniques": ["Cannot enter ocean tiles"],
		"upgradesTo": "Caravel",
		"obsoleteTech": "Astronomy",
		"attackSound": "nonmetalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Carthaginian unique unit is stronger than the Trireme which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The improved Strength of the Quinquereme makes it more useful than the Trireme for assaulting cities. It is also able to defeat Barbarian water units with ease." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Quinquereme (from latin 'quinque', meaning 'five' from the number of rowers per side) was a heavy warship that was the mainstay of the Carthaginian fleet. A quinquereme would have been about 45 meters long and displaced about 100 tons." },
{ "text": "Being larger than the classical triremes, they were more maneuverable in rough weather as well as able to carry a larger number of marines. This meant that tactics started favoring boarding actions alongside the classical ramming manoeuvres."},
{ "separator": true }
		]
	},
	/*
	{
		"name": "Galley",
		"unitType": "Water Melee",
		"uniqueTo": "Barbarian",
		"movement": 3,
		"strength": 7,
		"cost": 40,
		"uniques": ["Cannot enter ocean tiles"]
		"upgradesTo": "Trireme",
		"attackSound": "nonmetalhit"
		//Barbarian unique naval unit, weaker and slower than Trireme.
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "A Barbarian naval unit, looking to plunder your coasts!" },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Galley is not as strong as the Triremes of the civilized nations, but can still be an annoyance in the early game." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Galleys were used throughout the world for brown-water sailing. The addition of oars to a sailing ship allowed it to head against prevailing winds even without a keel. Of note in the ancient Mediterranean is for example the Liburnian, a light and speedy bireme used initially by Dalmatian pirates, but later copied by the Roman Empire."},
{ "separator": true }
		]
	},
	*/
	{
		"name": "Chariot Archer",
		"unitType": "Archery",
		"movement": 4,
		"strength": 6,
		"rangedStrength": 10,
		"cost": 56,
		"requiredTech": "The Wheel",
		"requiredResource": "Horses",
		"upgradesTo": "Knight",
		"obsoleteTech": "Chivalry",
		"uniques": ["No defensive terrain bonus", "Rough terrain penalty"],
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This early-game ranged units has great movement but needs to stop upon entering rough terrain." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The high movement rate of the Chariot Archer makes it useful for defending against Barbarians and early attacks, particularily in areas with lots of open ground." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The wheel was invented in the 4th millenium BC in the central Asian steppe, and spread outwards by the migration of Indo-European peoples. The chariot was a very useful weapon of war as it provided a steady enough platform to shoot arrows from while having increased mobility compared to foot archers." },
{ "text": "Chariots were universally adopted in places where the terrain permitted their use. They remained useful throughout the BC era but were eventually phased out as pike formations and crossbows came into use. A late use of the chariots was by the Britons during Boudicca's revolt in 61 AD."},
{ "separator": true }
		]
	},
	{
		"name": "War Chariot",
		"unitType": "Archery",
		"uniqueTo": "Egypt",
		"replaces": "Chariot Archer",
		"movement": 5,
		"strength": 6,
		"rangedStrength": 10,
		"cost": 56,
		"requiredTech": "The Wheel",
		"upgradesTo": "Knight",
		"obsoleteTech": "Chivalry",
		"uniques": ["No defensive terrain bonus", "Rough terrain penalty"],
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Egyptian unique unit is even faster than the Chariot Archer which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The War Chariot has similar strength as the Chariot Archer, but the extra mobility affords it greater strategic reach, being more able to strike at distant Barbarian encampments and to defend spread-out empires." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The chariot was probably introduced into Egypt by the Hyksos in the 1600s BC. The Egyptians quickly took to the invention and developed a lighter than usual chariot well suited to the terrain around the Nile. The charioteers formed an elite aristocratic class called the 'maryannu' and were the first to advance against the enemy in battle." },
{ "text": "Egyptian chariots carried one driver and one warrior, which could be armed with bow and spear. The chariot allowed the use of long bows and lots of ammunition, and its speed aided in pursuing fleeing enemies after the battle."},
{ "separator": true }
		]
	},
	{
		"name": "Horse Archer",
		"unitType": "Archery",
		"uniqueTo": "The Huns",
		"replaces": "Chariot Archer",
		"movement": 4,
		"strength": 7,
		"rangedStrength": 10,
		"cost": 56,
		"requiredTech": "The Wheel",
		"upgradesTo": "Knight",
		"obsoleteTech": "Chivalry",
		"uniques": ["No defensive terrain bonus"],
		"promotions": ["Accuracy I"],
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Hunnic unique unit does not require Horses and can move though rough terrain with less penalty than the Chariot Archer which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Horse Archer is the mainstay of the Hunnic army and is very dangerous in the early game. A large number can be built and allows the Huns to conquer their neighbors quickly." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Horse archery originated in Central Asia in the first millenium BC and was spread by the Iranian peoples. Countering horse archers was very difficult as they could outmanoeuvre the enemy while keeping up firing at them." },
{ "text": "The Huns were particularily feared as horse archers due to their use of the 'Hunnic' or recurve bow, which allowed firing arrows with a much greater force from a short bow, as well as the 'Parthian Shot', a tactic whereby the Huns would start to ride away from the enemy but then turn around in the saddle and fire back towards their pursuers." },
{ "text": "Horse archers would be used in war well into the 19th century by the Chinese, Russians, and Native Americans."},
{ "separator": true }
		]
	},
	{
		"name": "War Elephant",
		"unitType": "Archery",
		"uniqueTo": "India",
		"replaces": "Chariot Archer",
		"movement": 3,
		"strength": 9,
		"rangedStrength": 11,
		"cost": 70,
		"requiredTech": "The Wheel",
		"upgradesTo": "Knight",
		"obsoleteTech": "Chivalry",
		"uniques": ["No defensive terrain bonus"],
		"attackSound": "elephant"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Indian unique unit is stronger but slower and more expensive than the Chariot Archer which it replaces. It does not require Horses." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The War Elephant is as strong as Composite Bowmen but avaliable much earlier. It allows India a powerful defense in the early game." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "War Elephants originated in the Indian subcontinent some time before the 6th century BC. War Elephants would be widely used by all the classical Indian empires, and it was said that an army without elephants is as a kingdom without a king. Chandragupta Maurya wielded an army of 9000 war elephants." },
{ "text": "In battle, war elephants were deployed ahead of the rest of the army, to discourage charges by the enemy. Elephants could be used to charge into enemy lines as well as a stable elevated platform for archery, which allowed more accurate fire than by foot archers."},
{ "separator": true }
		]
	},
	{
		"name": "Spearman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 11,
		"cost": 56,
		"requiredTech": "Bronze Working",
		"obsoleteTech": "Civil Service",
		"upgradesTo": "Pikeman",
		"uniques": ["+[50]% Strength vs [Mounted]"],
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "An Ancient Era melee unit that is particularily strong against Mounted units." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Spearman is stronger than the Warrior and is useful when lacking Iron to build Swordsmen. They are also a counter to early game Mounted units such as the Greek Companion Cavalry and the Carthaginian African Forest Elephant." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The spear is one of the earliest weapons used by humans. In China it is known as 'the King of Weapons'. It can be used for throwing or thrusting, and allows its wielder an advantage of reach compared to other melee weapons. They were especially useful in an anti-cavalry role, where the longer reach helped deter charges. Spears gradually fell out of favor during the Middle ages, being replaced by halberds and pikes, but remained in use as a throwing weapon in Ireland into the 16th centure."},
{ "separator": true }
		]
	},
	{
		"name": "Hoplite",
		"unitType": "Sword",
		"replaces": "Spearman",
		"uniqueTo": "Greece",
		"movement": 2,
		"strength": 13,
		"cost": 56,
		"requiredTech": "Bronze Working",
		"obsoleteTech": "Civil Service",
		"upgradesTo": "Pikeman",
		"uniques": ["+[50]% Strength vs [Mounted]"],
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Greek unique unit is stronger than the Spearman which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Hoplite is nearly as strong as a Swordsman, reducing Greece's reliance on Iron in the Classical era. It is devastating against Classical era cavalry." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Hoplites were Greek citizen-soldiers armed with spears and shields. They wore body armor and fought in a square formation called the phalanx, which allowed the soldiers to protect and support each other. The hoplites demanded great cohesion as a single soldier running away or breaking formation could fatally weaken the entire phalanx. Hoplites were successful in defeating the Persians at the battles of Marathon and Platea, and were used throughout the Greek Classical age. Hoplites gradually fell out of use during the Hellenistic age as they were being replaced by the Macedonian pike-wielding phalanx."},
{ "separator": true }
		]
	},
	{
		"name": "Persian Immortal",
		"unitType": "Sword",
		"replaces": "Spearman",
		"uniqueTo": "Persia",
		"movement": 2,
		"strength": 12,
		"cost": 56,
		"requiredTech": "Bronze Working",
		"obsoleteTech": "Civil Service",
		"upgradesTo": "Pikeman",
		"uniques": ["+[50]% Strength vs [Mounted]","[+10] HP when healing"],
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Persian unique unit is slightly stronger than the Spearman it replaces, and also heals quicker." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The healing bonus is especially useful outside of friendly lands, making the Immortal good at battling Barbarians." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Immortals were the professional soldiers of the Achaemenid Empire, supplementing the tribal levies that made up the majority of the forces. They were possibly named such because the unit was always kept at exactly 10,000 soldiers. They played an important role in the Persian military campaigns of the 6th and 5th century BC."},
{ "text": "The Immortals were armed with spears and bows, as well as large shields. They were heavily armored with bronze scale mail. They wore a cloth cap that could be pulled down over the face to protect against dust and flying sand."},
{ "separator": true }
		]
	},
	{
		"name": "Battering Ram",
		"unitType": "Sword", // You might expect this to be a siege unit, but apparently it is not
		"replaces": "Spearman",
		"uniqueTo": "The Huns",
		"movement": 2,
		"strength": 10,
		"cost": 75,
		"requiredTech": "Bronze Working",
		"obsoleteTech": "Physics",
		"upgradesTo": "Trebuchet",
		"uniques": ["+[300]% Strength vs [City]", "No defensive terrain bonus", "+[-33]% Strength when defending",
		"-[1] Visibility Range", "Can only attack [City] units"],
		"promotions":  ["Cover I"],
		"attackSound": "throw"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Hunnic unique unit replaces the Spearman but is very different, being a specialised City attacker." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Battering Ram is a very strong city attacker, allowing the Huns to eliminate their opponents early. Its only weakness is enemy melee units, so it's best used together with Horse Archers." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "A battering ram is in its simplest form a log which is smashed against a defenders gate or wall to destroy it. Later developments include putting the ram on wheels which allows a heavier ram than can be carried, and adding a roof to protect against defender's arrows."},
{ "text": "A number of countermeasures agains rams were developed, such as digging moats around walls to prevent access, or setting it on fire with flaming arrows."},
{ "separator": true }
		]
	}
	/*
	{
		"name": "Spearman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 10,
		"cost": 56,
		"requiredTech": "Bronze Working",
		"obsoleteTech": "Civil Service",
		"upgradesTo": "Pikeman",
		"uniques": ["+[50]% Strength vs [Mounted]"],
		"attackSound": "metalhit"
		// Barbarian unique Spearman. Has same icon and name but slightly different 3d texture
	},
	*/

	/* Classical Era */
	{
		"name": "Horseman",
		"unitType": "Mounted",
		"movement": 4,
		"strength": 12,
		"cost": 75,
		"requiredTech": "Horseback Riding",
		"requiredResource": "Horses",
		"upgradesTo": "Knight",
		"obsoleteTech": "Metallurgy",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]" ],
		"hurryCostModifier": 20,
		"attackSound": "horse"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "The first Mounted unit, the Horseman is a strong and fast fighter but not well suited to attacking cities." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Horseman can move after attacking, making it able to attack eg a ranged unit, and then retreat back to safety. Its high movement speed also aids in pillaging enemy lands." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "True horsemen as opposed to charioteers first appear in the 10th century BC in Mesopotamia. Later inventions such as the saddle, stirrups and larger breeds of horses would greatly improve their efficacy in battle."},
{ "text": "Central Asian cultures such as the Scythians and Xiongnu were famed for their skill at horseback, and feared for their ability to quickly strike and retreat before settled civilizations could mount an effective defense."},
{ "separator": true }
		]
	},
	{
		"name": "Companion Cavalry",
		"unitType": "Mounted",
		"uniqueTo": "Greece",
		"replaces": "Horseman",
		"movement": 5,
		"strength": 14,
		"cost": 75,
		"requiredTech": "Horseback Riding",
		"upgradesTo": "Knight",
		"obsoleteTech": "Metallurgy",
		"promotions": ["Great Generals I"],
		"requiredResource": "Horses",
		"uniques": ["Can move after attacking", "No defensive terrain bonus", "-[33]% Strength vs [City]"],
		"hurryCostModifier": 20,
		"attackSound": "horse"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Greek unique unit is stronger and faster than the Horseman it replaces, and also generates Great Generals more quickly." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Companion Cavalry is an extraordinarily strong Classical unit, only weak against cities. Make sure to use it against a neighboring civilization to leverage its bonus to Great General points." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Companion Cavalry was created by Philip II of Macedon and most famously used by Alexander the Great during his conquests. It was an early heavy cavalry, wearing bronze armor and using long spears calles 'xyston' to deliver devastating charges."},
{ "text": "They were used in conjunction with the Macedonian Phalax in a tactic called 'Hammer and Anvil', where the infantry would fix the enemy forces (the anvil) while the Companions would ride around and attempt to charge the enemy from behind (the hammer). Alexander the Great personally led the charge of his Companions."},
{ "text": "The Successor kingdoms during the Hellenistic era would also field units with similar equipment as the Companions, though only the Seleucids retained the title." }
{ "separator": true }
		]
	},
	{
		"name": "African Forest Elephant",
		"unitType": "Mounted",
		"uniqueTo": "Carthage",
		"replaces": "Horseman",
		"movement": 3,
		"strength": 14,
		"cost": 100,
		"requiredTech": "Horseback Riding",
		"upgradesTo": "Knight",
		"obsoleteTech": "Metallurgy",
		"promotions": ["Great Generals II"],
		"uniques": ["Can move after attacking", "No defensive terrain bonus", "-[33]% Strength vs [City]","[-10]% Strength for enemy [Military] units in adjacent [All] tiles"],
		"hurryCostModifier": 20,
		"attackSound": "elephant"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Carthaginian unique unit is stronger but slower and more expensive than the Horseman it replaces. It also has a large bonus to Great General generation and lowers the efficiency of adjacent enemy units." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Though too expensive to form the bulk of a Carthaginian army, the African Forest Elephant is useful for its debuff of adjacent units, and can also help generate the first General required by Carthage to cross mountains." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Being situated in western North Africa, Carthage did not have easy access to stocks of Indian Elephants. Rather they had to make do with the smaller North African Elephants, which would go extinct from overuse but was possibly similar to the modern day African Forest Elephants. Despite their small size they appear to have been outfitted with Howdahs or turrets at least some of the time." },
{ "text": "The Carthaginians used war elephants extensively during the First and Second Punic Wars. Hannibal famously marched across the alps with, among other troops, a corps of elephants which contributed greatly to his victory at the Trebia in 218 BC." },
{ "separator": true }
		]
	},
	{
		"name": "Catapult",
		"unitType": "Siege",
		"movement": 2,
		"strength": 7,
		"rangedStrength": 8,
		"cost": 75,
		"requiredTech": "Mathematics",
		"obsoleteTech": "Physics",
		"upgradesTo": "Trebuchet",
		"uniques": ["+[200]% Strength vs [City]", "No defensive terrain bonus",
			"Must set up to ranged attack", "Limited Visibility"],
		"hurryCostModifier": 20,
		"attackSound": "throw"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "The first Siege unit. It needs to spend a movement point to set up before attacking." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Catapult is the first unit able to take on Cities effectively. You need one or more if planning to conquer a neighbor." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Various siege engines called Catapults were invented in the Mediterranean from the 4th century BC. Commonly these were arrow-firing machines related to the crossbow. The first stone-throwing machines recongnizable as the catapults of popular imagination were the so called onagers (latin for 'wild donkey', from their kicking action), used by the Romans from the 4th to 6th century AD."},
{ "text": "Torsion-spring catapults went out of fashion with the introduction of the mangonel or traction trebuchet by the Avars in the 6th century. The Chinese had already been using mangonels since the 4th century BC. The mangonel would remain in use until the development of the counterweight trebuchet in the 12th century."},
{ "separator": true }
		]
	},
	{
		"name": "Ballista",
		"unitType": "Siege",
		"replaces": "Catapult",
		"uniqueTo": "Rome",
		"movement": 2,
		"strength": 8,
		"rangedStrength": 10,
		"cost": 75,
		"requiredTech": "Mathematics",
		"obsoleteTech": "Physics",
		"upgradesTo": "Trebuchet",
		"uniques": ["+[200]% Strength vs [City]", "No defensive terrain bonus",
			"Must set up to ranged attack", "Limited Visibility"],
		"hurryCostModifier": 20,
		"attackSound": "throw"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Roman unique unit is stronger than the Catapult which it replaces." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Use it together with Legions for attacking or eliminating a neighbor in the Classical era." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Ballista was originally developed in Syracuse from earlier Greek crossbow-like war engines. It consisted of two torsion-loaded arms connected by a drawstring, and was able to fire arrows or stones accurately. Alexander the Great was the first to display its potential as a siege weapon, and kept a siege engineer corps to construct them on site."},
{ "text": "The Romans took to the Ballista enthusiastically and developed it further, including a portable variant called the Scorpion, as well as variants for deployment in defensive towers. Julius Caesar used ballista fired from his ships to support the landing of troops in Britain. It would eventually be replaced by the mangonel."},
{ "separator": true }
		]
	},
	{
		"name": "Composite Bowman",
		"unitType": "Archery",
		"movement": 2,
		"strength": 7,
		"rangedStrength": 11,
		"cost": 75,
		"requiredTech": "Construction",
		"obsoleteTech": "Machinery",
		"upgradesTo": "Crossbowman",
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Classical Era ranged unit, upgrades from the Archer." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Composite Bowman is a significant upgrade from the Archer. A couple of these, especially placed within cities, is very helpful in defending against early attacks." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "A composite bow is a bow made from several different materials glued together - usually horn, wood, and sinew - as opposed to a self bow which is made from a single piece of wood. Composite bows are able to use different material properties such as tensile and compressive strengths to create a more powerful bow. The main drawback is that the glues used before modern times were not waterproof, so it became necessary to protect the bow from moisture. For this reason composite bows saw little use in very humid areas such as southern China." },
{ "text": "In the old world, the composite bow was invented sometime in the 2nd millenium BC, in the Asiatic steppe. The technology was rapidly adopted especially in mounted archery, where the small but powerful bows were a larga advantage. Composite bows may also have been independently developed by the Native Americans." },
{ "separator": true }
		]
	},
	{
		"name": "Swordsman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 14,
		"cost": 75,
		"requiredTech": "Iron Working",
		"upgradesTo": "Longswordsman",
		"obsoleteTech": "Steel",
		"requiredResource": "Iron",
		"hurryCostModifier": 20,
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Classical Era melee unit, upgrades from the Warrior." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Swordsman is useful for attacking cities, if you can source the iron to build them early enough. Beware that they will lose some of their strength if you lose access to the iron." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The earliest swords date from the 3rd millenium BC and were made from bronze or copper. Because of the low stiffness of bronze the blades would bend easily and swords had to be made short, usually around 60 cm. The introduction of iron permitted large numbers of soldiers to be equipped with swords as iron was much more avaliable and less expensive than bronze. Due to the low carbon content and primitive blacksmithing techniques the iron was not any stronger than bronze and swords remained short until the invention of steel." },
{ "text": "Short swords were used in many parts of the world, such as the Roman gladius, Greek xiphos, and Chinese jian. The Celts were also particularily noted for their skill in sword-making." },
{ "separator": true }
		]
	},
	{
		"name": "Legion",
		"unitType": "Sword",
		"uniqueTo": "Rome",
		"replaces": "Swordsman",
		"movement": 2,
		"strength": 17,
		"cost": 75,
		"requiredTech": "Iron Working",
		"upgradesTo": "Longswordsman",
		"obsoleteTech": "Gunpowder",
		"requiredResource": "Iron",
		"uniques": ["Can build [Road] improvements on tiles", "Can build [Fort] improvements on tiles"],
		"hurryCostModifier": 20,
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Roman unique unit is stronger than the Swordsman it replaces, and also has the ability to build Roads and Forts." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Legion costs only slightly more than a Worker and is just as good at building roads, so you might as well build a couple for roads alone. The great combat strength is a nice bonus." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Legions originated as consular armies. The early legions had, in addition to small numbers of cavalry and skirmishers, three lines of infantry: the Hastati, the greenest, which would advance against the enemy first. Then the Principes, the more experienced and better equipped soldiers, which would attack if the hastati failed to break the enemy. The third line was the Triarii, who were the most experienced and armed with long spears. They would only be called upon in extreme circumstances and 'going to the triarii' was a Roman saying, meaning to see things through to the bitter end. The so-called 'Marian' reforms did away with the three-tier system and standardized equipment for all legionaries to a stabbing sword called the gladius, a large shield called the scutum, and two throwing spears called pila." },
{ "text": "Apart from fighting, Roman Legions were also used for construction projects such as roads and aqueducts. They were also adept at building fortifications and when on the march would construct a fortified camp for every night and always sleep in the same layout to reduce disorder if attacked during the night." },
{ "separator": true }
		]
	},
	{
		"name": "Mohawk Warrior",
		"unitType": "Sword",
		"uniqueTo": "Iroquois",
		"replaces": "Swordsman",
		"movement": 2,
		"strength": 14,
		"cost": 75,
		"requiredTech": "Iron Working",
		"upgradesTo": "Longswordsman",
		"obsoleteTech": "Gunpowder",
		"hurryCostModifier": 20,
		"uniques": ["+[33]% Strength in [Forest]", "+[33]% Strength in [Jungle]"],
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Iroquois unique unit is better at fighting in wooded areas than the Swordsman it replaces, and also does not require Iron." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The lack of resource requirement means the Iroquois can always rely on producing a number of these for early conquests or to defend themselves. The bonus in Forests has a good synergy with the Iroquois unique ability when defending in their own territory." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Mohawk are the easternmost of the Iroquois people, and live around the Mohawk river which is a tributary of the Hudson. They originally came into contact with European when Samuel de Champlain led an expedition into their lands which sparked the Beaver Wars. During the next hundred years, the Mohawk population would be decimated by smallpox as well as constant war, but the Mohawk were nevertheless able to successfully expand their territories, raiding neighboring Algonquin tribes." },
{ "text": "The Mohawk came to notoriety in America after siding with the British in the Revolutionary War, and again during the War of 1812. After the wars most Mohawk were forced to move into Canada. During the 20th century many Mohawk have returned to New York. The traditional Mohawk hairstyle consists of plucking out most of the hair on the head until only a small sector remains. This has inspired the modern 'Mohawk' hairstyle associated with punk rock, which is perhaps the most well-known legacy of the Mohawk today." },
{ "separator": true }
		]
	},
	/*
	{
		"name": "Swordsman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 14,
		"cost": 75,
		"requiredTech": "Iron Working",
		"upgradesTo": "Longswordsman",
		"obsoleteTech": "Gunpowder",
		"requiredResource": "Iron",
		"hurryCostModifier": 20,
		"attackSound": "metalhit"
		// Barbarian unique Swordsman. Has same icon and name but slightly different 3d texture
	},
	*/

	// Medieval Era
	{
		"name": "Pikeman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 16,
		"cost": 90,
		"requiredTech": "Civil Service",
		"uniques": ["+[50]% Strength vs [Mounted]"],
		"upgradesTo": "Lancer",
		"obsoleteTech": "Gunpowder",
		"attackSound": "metalhit" 
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "A Medieval upgrade on the Spearman, has a bonus against Mounted units." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Pikeman is the strongest melee unit for most of the Medieval Era, and is worth having even if not fighting Mounted units, especially as it does not require any resources. Bear in mind that it upgrades to the mounted Lancer when choosing promotions for it." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "A pike is much like a very long spear, around 6-7 meters. The great length means that the pikes of several lines of soldiers can project over each other, presenting a massive wall of pike-points. Pikes were already used by the Macedonians of Alexander the Great, but fell out of use in the Roman era. In the Medieval Era, pikes became common in infantry-based armies that lacked a large amount of knights, such as the Flemish, Swiss, and Scots. In China and Japan, the ji and yari respectively were sometimes as long as European pikes. The Hawaiian warriors of Kamehameha I also fought with long spears similar to pikes." },
{ "text": "The pike saw its greatest use during the 'Pike and Shot' era, from the 16th to 17th century, where pikemen would form the bulk of armies, with support from musketeers and cavalry. The pike gradually fell out of use during the 18th century with improvements in musket and artillery fire, as well as improved bayonets meaning musketeers were able to perform some of the pikemen's roles. The last time pikes were issued as a weapon of war was in 1942 when the British Home Guard, faced with severe weapons shortages, issued steel pikes as an emergency weapon. They were not used in combat at this time." },
{ "separator": true }
		]
	},
	{
		"name": "Landsknecht",
		"unitType": "Sword",
		"replaces": "Pikeman",
		"uniqueTo": "Germany",
		"movement": 2,
		"strength": 16,
		"cost": 45,
		"requiredTech": "Civil Service",
		"uniques": ["+[50]% Strength vs [Mounted]", "Can move immediately once bought" ],
		"upgradesTo": "Lancer",
		"obsoleteTech": "Gunpowder",
		"attackSound": "metalhit"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This German unique unit is similar to the Pikeman but much quicker to build and can move the same turn it is bought." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Landsknecht is a great unit for overwhelming the enemy with numbers. It can also be used as an emergency defense to attack enemy siege units from besieged cities." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "Landsknechts originated as mercenary soldiers during the 15th century, raised to defeat the Swiss pikemen. They were highly trained with pikes and swords and able to perform precise manoeuvres on the battlefield, and won many important victories over the Swiss and other enemies. Over time the Landsknechts became the bulk of the Imperial (Holy Roman) army, and were raised by contract with colonels who acted as subcontractors to the state." },
{ "text": "The image of Landsknechts was much tarnished after the sack of Rome in 1527, where Landsknechts fighting for Charles V, angry at not being paid in time, looted and nearly depopulated the city. The event has been called the end of the Italian Renaissance and the Landsknechts gained a reputation for poor discipline and looting. During the 17th century, the Landsknecht system was phased out to be replaced with the Fussknecht system, which was less reliant on mercenaries." },
{ "separator": true }
		]
		//"Requires [Mercenary Army]" in BNW
	},
	{
		"name": "Galleass",
		"unitType": "Ranged Water",
		"movement": 3,
		"strength": 16,
		"rangedStrength": 17,
		"cost": 100,
		"requiredTech": "Compass",
		"obsoleteTech": "Navigation",
		"upgradesTo": "Frigate",
		"uniques": ["Cannot enter ocean tiles"],
		"attackSound": "arrow"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "The Galleass is the first Ranged Naval unit, able to bombard land units as well as naval units without fear of retaliation." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The main limitation of the Galleass is its inability to enter oceans. Still, when attacking an enemy with whom you share a coast, or when defending on the water, it is an essential unit due to its range." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "A Galleass is a larger form of a galley, built to support a large number of artillery pieces. They were frequently used in the 16th century Mediterranean in conjunction with the smaller galleys. The galleys would mount one large cannon each, pointing forwards, and the galleasses would have several medium-calibre pieces to cover the galleys and prevent the enemy from closing to boarding. Venetian galleasses famously resisted the initial Ottoman attack during the battle of Lepanto in 1571, leading to eventual victory for the Holy League." },
{ "text": "In Southeast Asia, Iskandar Muda of the Aceh Sultanate used a large number of galleasses during his conquests in the 17th century. A similar pattern of large galleys with large amount of guns was also used in the design of the Swedish Turuma-type Archipelago ships, which were used during the late 18th century. As artillery became more precise and longer ranged, however, galleys lost their advantage against blue water sailing warships, and by the the 19th century smaller gun sloops were found to be more efficient in brown water engagements." },
{ "separator": true }
		]
	},
	{
		"name": "Knight",
		"unitType": "Mounted",
		"movement": 4,
		"strength": 20,
		"cost": 120,
		"requiredTech": "Chivalry",
		"obsoleteTech": "Military Science",
		"upgradesTo": "Cavalry",
		"requiredResource": "Horses",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]" ],
		"attackSound": "horse"
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "Medieval Era Mounted unit, upgrade from the Horseman." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "Use in much the same way as Horsemen, for hit-and-run attacks on Ranged units as well as Pillaging. The early availability of Pikemen reduces their utility in fighting somewhat." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "In Europe, Knights were a member of a warrior class distinguished by their use of heavy armor and horses. They often served a local lord who was in turn a vassal of the king, who could call upon the knights in wartime. Knights would often hold some land for themselves and the title could become hereditary. Aside from fighting, knights were expected to behave in a chivalrous manner at all times. Knighthood played a large role in European Medieval art and was the subject of chivalric romances and ballads. Knights diminished in importance during the 15th century as nations became more able to recruit proffessional armies, and new weapons such as the pike reduced the dominance of heavy cavalry." },
{ "text": "Comparable warrior classes outside Europe include the Indian Kshatriya, the Phillipine Timawa, the Japanese Samurai, and the Aztec Eagle Warriors." },
{ "separator": true }
		]
	},
	{
		"name": "Camel Archer",
		"unitType": "Archery",
		"replaces": "Knight",
		"uniqueTo": "Arabia",
		"movement": 4,
		"strength": 17,
		"rangedStrength": 21,
		"cost": 120,
		"requiredTech": "Chivalry",
		"requiredResource": "Horses",
		"upgradesTo": "Cavalry",
		"obsoleteTech": "Military Science",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"attackSound": "arrow"
		//Camel Archer should have no penalty attacking cities
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Arabian unique unit is ranged, unlike the Knight which it replaces" },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Camel Archer is a superior ranged unit, with the strongest ranged attack until Artillery and Gatling Guns. Its ability to move after attacking enables it to bombard cities and other ranged units without fear of reprisal. Its only drawback is that it upgrades to a non-ranged unit, so consider delaying the upgrade." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The first recorded use of camel archers is when Xerxes I of Persia recruited a large number of Arab mercenaries for his invasion of Greece, all of which fought as camel archers. Camel archers were subsequently employed by Nabateans and Palmyrans for skirmishing and desert patrols. Camel archers are also mentioned in the Bible. Camels are taller and steadier than horses which can aid in shooting from camelback, still most archers would dismount before a battle." },
{ "text": "A later development is the Zamburak, which is a small swivel gun mounted on camelback, which was used to devastating effect by Nader Shah in the 18th century." },
{ "separator": true }
		]
	},
	{
		"name": "Conquistador",
		"unitType": "Mounted",
		"replaces": "Knight",
		"uniqueTo": "Spain",
		"movement": 4,
		"strength": 20,
		"cost": 135,
		"requiredTech": "Chivalry",
		"requiredResource": "Horses",
		"upgradesTo": "Cavalry",
		"obsoleteTech": "Military Science",
		"uniques": ["Can move after attacking","No defensive terrain bonus", "Founds a new city", "[+2] Visibility Range", "Defense bonus when embarked"],
		"attackSound": "horse"
		//Conquistador should have no penalty attacking cities
		//Ability to found new cities can only be used on a foreign continent that does not contain the Spanish capital.
		"civilopediaText": [
{ "header": 3, "text": "Game Info"},
{ "text": "This Spanish unique unit is more effective against cities than the Knight which it replaces. It also has increased visibility range, a defense bonus when embarked, and can be used to found new cities on distant continents. It is more expensive than the Knight." },
{ "separator": true },
{ "header": 3, "text": "Strategy"},
{ "text": "The Conquistador is specialised in exploring and settling new continents during the Renaissance. It is faster and has greater sight than a Scout, and acts as a Settler without needing an escort. Its drawback is the high cost. It is more expensive than a Settler so don't build them solely for founding cities." },
{ "separator": true },
{ "header": 3, "text": "Historical Info"},
{ "text": "The Conquistadors were the Spanish (and Portuguese) conquerors and adventurers that colonized the New World after its discovery in 1492. They were sometimes financed by the Spanish crown, but just as often by local governors or by pure motive of profit as news of the riches of the New World spread back to Spain." },
{ "text": "Famous Conquistadors include Hernán Cortéz, who conquered the Aztec Empire in 1519-21, as well as Francisco Pizarro, who conquered the Incan Empire in 1532. The Conquistadors were often drastically outnumbered by their enemies and relied on cunning alliance-making as well as the psychological impact of gunpowder weapons and horses for their quick victories." },
{ "separator": true }
		]
	},
	{
		"name": "Naresuan's Elephant",
		"unitType": "Mounted",
		"replaces": "Knight",
		"uniqueTo": "Siam",
		"movement": 3,
		"strength": 25,
		"cost": 120,
		"requiredTech": "Chivalry",
		"obsoleteTech": "Military Science",
		"upgradesTo": "Cavalry",
		"uniques": ["Can move after attacking","No defensive terrain bonus","+[50]% Strength vs [Mounted]","-[33]% Strength vs [City]"],
		"attackSound": "elephant"
	},
	{
		"name": "Mandekalu Cavalry",
		"unitType": "Mounted",
		"replaces": "Knight",
		"uniqueTo": "Songhai",
		"movement": 4,
		"strength": 20,
		"cost": 110,
		"requiredTech": "Chivalry",
		"requiredResource": "Horses",
		"upgradesTo": "Cavalry",
		"obsoleteTech": "Military Science",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"attackSound": "horse"
	},
	{
		"name": "Keshik",
		"unitType": "Archery",
		"replaces": "Knight",
		"uniqueTo": "Mongolia",
		"range": 2,
		"movement": 5,
		"strength": 15,
		"rangedStrength": 16,
		"cost": 120,
		"requiredTech": "Chivalry",
		"requiredResource": "Horses",
		"upgradesTo": "Cavalry",
		"obsoleteTech": "Military Science",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"promotions": ["Great Generals I", "Quick Study"],
		"attackSound": "arrow"
		// Keshik should have no penalty attacking cities
	},
	{
		"name": "Crossbowman",
		"unitType": "Archery",
		"movement": 2,
		"strength": 13,
		"rangedStrength": 18,
		"cost": 120,
		"requiredTech": "Machinery",
		"upgradesTo": "Gatling Gun",
		"obsoleteTech": "Industrialization",
		"attackSound": "arrow"
	},
	{
		"name": "Chu-Ko-Nu",
		"unitType": "Archery",
		"uniqueTo": "China",
		"movement": 2,
		"strength": 13,
		"rangedStrength": 14,
		"replaces": "Crossbowman",
		"cost": 120,
		"requiredTech": "Machinery",
		"upgradesTo": "Gatling Gun",
		"obsoleteTech": "Industrialization",
		"promotions": ["Logistics"],
		"attackSound": "arrow"
	},
	{
		"name": "Longbowman",
		"unitType": "Archery",
		"range": 2,
		"movement": 2,
		"strength": 13,
		"rangedStrength": 18,
		"replaces": "Crossbowman",
		"uniqueTo": "England",
		"cost": 120,
		"requiredTech": "Machinery",
		"upgradesTo": "Gatling Gun",
		"obsoleteTech": "Industrialization",
		"promotions": ["Extended Range"],
		"attackSound": "arrow"
	},
	{
		"name": "Trebuchet",
		"unitType": "Siege",
		"movement": 2,
		"strength": 12,
		"rangedStrength": 14,
		"cost": 120,
		"requiredTech": "Physics",
		"obsoleteTech": "Chemistry",
		"upgradesTo": "Cannon",
		"uniques": ["+[200]% Strength vs [City]","No defensive terrain bonus","Must set up to ranged attack","Limited Visibility"],
		"attackSound": "throw"
	},
	{
		"name": "Hwach'a",
		"unitType": "Siege",
		"replaces": "Trebuchet",
		"uniqueTo": "Korea",
		"movement": 2,
		"strength": 11,
		"rangedStrength": 26,
		"cost": 120,
		"requiredTech": "Physics",
		"obsoleteTech": "Chemistry",
		"upgradesTo": "Cannon",
		"uniques": ["No defensive terrain bonus","Must set up to ranged attack"],
		"attackSound": "throw"
	},
	{
		"name": "Longswordsman",
		"unitType": "Sword",
		"movement": 2,
		"strength": 21,
		"cost": 120,
		"requiredTech": "Steel",
		"upgradesTo": "Musketman",
		"obsoleteTech": "Gunpowder",
		"requiredResource": "Iron",
		"attackSound": "metalhit"
	},
	{
		"name": "Samurai",
		"unitType": "Sword",
		"replaces": "Longswordsman",
		"uniqueTo": "Japan",
		"movement": 2,
		"strength": 21,
		"cost": 120,
		"requiredTech": "Steel",
		"upgradesTo": "Musketman",
		"obsoleteTech": "Gunpowder",
		"requiredResource": "Iron",
		"promotions": ["Shock I", "Great Generals II"],
		"attackSound": "metalhit"
		//Samurai should also create Fishing Boats (not now, surely)
	},
	{
		"name": "Berserker",
		"unitType": "Sword",
		"replaces": "Longswordsman",
		"uniqueTo": "Denmark",
		"movement": 3,
		"strength": 21,
		"cost": 120,
		"requiredTech": "Metal Casting",
		"upgradesTo": "Musketman",
		"obsoleteTech": "Metallurgy",
		"requiredResource": "Iron",
		"promotions": ["Amphibious"],
		"hurryCostModifier": 20,
		"attackSound": "metalhit"
		//Danish unique unit. Can attack from the sea without any penalty, and moves faster.
	},

	// Rennaisance Era

	{
		"name": "Caravel",
		"unitType": "Melee Water",
		"movement": 4,
		"strength": 20,
		"cost": 120,
		"requiredTech": "Astronomy",
		"upgradesTo": "Ironclad",
		"obsoleteTech": "Combustion",
		"uniques": ["[+1] Visibility Range", "May withdraw before melee ([80]%)"],
		"hurryCostModifier": 30,
		"attackSound": "cannon"
	},
	{
		"name": "Turtle Ship",
		"unitType": "Melee Water",
		"replaces": "Caravel",
		"uniqueTo": "Korea",
		"movement": 4,
		"strength": 36,
		"cost": 120,
		"requiredTech": "Astronomy",
		"upgradesTo": "Ironclad",
		"obsoleteTech": "Combustion",
		"uniques": ["Cannot enter ocean tiles"],
		"hurryCostModifier": 30,
		"attackSound": "cannon"
	},
	{
		"name": "Musketman",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 24,
		"cost": 150,
		"requiredTech": "Gunpowder",
		"upgradesTo": "Rifleman",
		"obsoleteTech": "Rifling",
		"attackSound": "shot"
	},
	{
		"name": "Musketeer",
		"unitType": "Gunpowder",
		"replaces": "Musketman",
		"uniqueTo": "France",
		"movement": 2,
		"strength": 28,
		"cost": 150,
		"requiredTech": "Gunpowder",
		"upgradesTo": "Rifleman",
		"obsoleteTech": "Rifling",
		"attackSound": "shot"
	},
	{
		"name": "Janissary",
		"unitType": "Gunpowder",
		"replaces": "Musketman",
		"uniqueTo": "The Ottomans",
		"movement": 2,
		"strength": 24,
		"cost": 150,
		"requiredTech": "Gunpowder",
		"upgradesTo": "Rifleman",
		"obsoleteTech": "Rifling",
		"uniques": ["Heals [50] damage if it kills a unit", "+[25]% Strength when attacking"],
		"attackSound": "shot"
	},
	{
		"name": "Minuteman",
		"unitType": "Gunpowder",
		"replaces": "Musketman",
		"uniqueTo": "America",
		"movement": 2,
		"strength": 24,
		"cost": 150,
		"requiredTech": "Gunpowder",
		"upgradesTo": "Rifleman",
		"obsoleteTech": "Rifling",
		"uniques": ["Ignores terrain cost"],
		"promotions": ["Drill I"],
		"attackSound": "shot"
	},
	{
		"name": "Tercio",
		"unitType": "Gunpowder",
		"replaces": "Musketman",
		"uniqueTo": "Spain",
		"movement": 2,
		"strength": 26,
		"cost": 160,
		"requiredTech": "Gunpowder",
		"upgradesTo": "Rifleman",
		"obsoleteTech": "Rifling",
		"uniques": ["+[50]% Strength vs [Mounted]"],
		"attackSound": "shot"
	},
	{
		"name": "Privateer",
		"unitType": "Melee Water",
		"movement": 5,
		"strength": 25,
		"cost": 150,
		"requiredTech": "Navigation",
		"upgradesTo": "Destroyer",
		"promotions": ["Coastal Raider I"],
		"uniques": ["May capture killed [Water] units"],
		"attackSound": "cannon"
	},
	{
		"name": "Sea Beggar",
		"unitType": "Melee Water",
		"replaces": "Privateer",
		"uniqueTo": "The Netherlands",
		"movement": 5,
		"strength": 25,
		"cost": 150,
		"requiredTech": "Navigation",
		"upgradesTo": "Destroyer",
		"promotions": ["Coastal Raider I", "Coastal Raider II", "Supply"],
		"uniques": ["May capture killed [Water] units"]
	},
	{
		"name": "Frigate",
		"unitType": "Ranged Water",
		"movement": 5,
		"strength": 25,
		"rangedStrength": 28,
		"cost": 185,
		"requiredResource": "Iron",
		"requiredTech": "Navigation",
		"obsoleteTech": "Electronics",
		"upgradesTo": "Battleship",
		"hurryCostModifier": 20,
		"attackSound": "cannon"
	},
	{
		"name": "Ship of the Line",
		"unitType": "Ranged Water",
		"replaces": "Frigate",
		"uniqueTo": "England",
		"movement": 5,
		"strength": 30,
		"rangedStrength": 35,
		"cost": 185,
		"requiredResource": "Iron",
		"uniques": ["[+1] Visibility Range"],
		"requiredTech": "Navigation",
		"obsoleteTech": "Electronics",
		"upgradesTo": "Battleship",
		"hurryCostModifier": 20,
		"attackSound": "cannon"
	},
	{
		"name": "Lancer",
		"unitType": "Mounted",
		"movement": 4,
		"strength": 25,
		"cost": 185,
		"requiredTech": "Metallurgy",
		"requiredResource": "Horses",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]"],
		"promotions": ["Formation I"],
		"upgradesTo": "Anti-Tank Gun",
		"obsoleteTech": "Combined Arms",
		"attackSound": "horse"
	},
	{
		"name": "Sipahi",
		"unitType": "Mounted",
		"replaces": "Lancer",
		"uniqueTo": "The Ottomans",
		"movement": 5,
		"strength": 25,
		"cost": 185,
		"requiredTech": "Metallurgy",
		"requiredResource": "Horses",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]",
			"[+1] Visibility Range", "No movement cost to pillage"],
		"promotions": ["Formation I"],
		"upgradesTo": "Anti-Tank Gun",
		"obsoleteTech": "Combined Arms",
		"attackSound": "horse"
	},
	{
		"name": "Hakkapeliitta",
		"unitType": "Mounted",
		"replaces": "Lancer",
		"uniqueTo": "Sweden",
		"movement": 4,
		"strength": 25,
		"cost": 185,
		"requiredTech": "Metallurgy",
		"requiredResource": "Horses",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]",
			"Transfer Movement to [Great General]", "[+15]% Strength when stacked with [Great General]"],
		"promotions": ["Formation I"],
		"upgradesTo": "Anti-Tank Gun",
		"obsoleteTech": "Combined Arms",
		"attackSound": "horse"
	},
	{
		"name": "Cannon",
		"unitType": "Siege",
		"movement": 2,
		"strength": 14,
		"rangedStrength": 20,
		"cost": 185,
		"requiredTech": "Chemistry",
		"upgradesTo": "Artillery",
		"obsoleteTech": "Dynamite",
		"uniques": ["+[200]% Strength vs [City]","No defensive terrain bonus","Must set up to ranged attack","Limited Visibility"],
		"attackSound": "cannon"
	},

	// Industrial Era

	{
		"name": "Gatling Gun",
		"unitType": "Ranged Gunpowder",
		"range": 1,
		"movement": 2,
		"strength": 30,
		"rangedStrength": 30,
		"cost": 225,
		"requiredTech": "Industrialization",
		"upgradesTo": "Machine Gun",
		"obsoleteTech": "Ballistics",
		"attackSound": "machinegun"
	},
	{
		"name": "Rifleman",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Rifling",
		"obsoleteTech": "Replaceable Parts",
		"upgradesTo": "Great War Infantry",
		"attackSound": "shot"
	},
	{
		"name": "Norwegian Ski Infantry",
		"unitType": "Gunpowder",
		"replaces": "Rifleman",
		"uniqueTo": "Denmark",
		"movement": 2,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Rifling",
		"obsoleteTech": "Replaceable Parts",
		"upgradesTo": "Great War Infantry",
		"uniques": ["+[25]% Strength in [Snow]", "+[25]% Strength in [Tundra]", "+[25]% Strength in [Hill]", "Double movement in Snow, Tundra and Hills"],
		"attackSound": "shot"
	},
	{
		"name": "Carolean",
		"unitType": "Gunpowder",
		"replaces": "Rifleman",
		"uniqueTo": "Sweden",
		"movement": 2,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Rifling",
		"obsoleteTech": "Replaceable Parts",
		"upgradesTo": "Great War Infantry",
		"promotions": ["March"],
		"attackSound": "shot"
	},
	{
		"name": "Cavalry",
		"unitType": "Mounted",
		"movement": 4,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Military Science",
		"obsoleteTech": "Combustion",
		"requiredResource": "Horses",
		"upgradesTo": "Landship",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]" ],
		"attackSound": "horse"
	},
	{
		"name": "Cossack",
		"unitType": "Mounted",
		"replaces": "Cavalry",
		"uniqueTo": "Russia",
		"movement": 4,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Military Science",
		"obsoleteTech": "Combustion",
		"requiredResource": "Horses",
		"upgradesTo": "Landship",
		"uniques": ["Can move after attacking","No defensive terrain bonus",
			"-[33]% Strength vs [City]", "+[50]% Strength vs [wounded units]"],
		"attackSound": "horse"
	},
	{
		"name": "Hussar",
		"unitType": "Mounted",
		"replaces": "Cavalry",
		"uniqueTo": "Austria",
		"movement": 5,
		"strength": 34,
		"cost": 225,
		"requiredTech": "Military Science",
		"obsoleteTech": "Combustion",
		"requiredResource": "Horses",
		"upgradesTo": "Landship",
		"uniques": ["Can move after attacking","No defensive terrain bonus","-[33]% Strength vs [City]" ,
		"[+1] Visibility Range", "[+50]% to Flank Attack bonuses" ],
		"attackSound": "horse"
	},
	{
		"name": "Ironclad",
		"unitType": "Melee Water",
		"movement": 3,
		"strength": 45,
		"cost": 250,
		"requiredTech": "Steam Power",
		"requiredResource": "Coal",
		"upgradesTo": "Destroyer",
		"obsoleteTech": "Combustion",
		"uniques": ["+[33]% Strength vs [City]","Double movement in coast"],
		"attackSound": "shipguns"
	},
	{
		"name": "Artillery",
		"unitType": "Siege",
		"movement": 2,
		"strength": 21,
		"rangedStrength": 28,
		"range": 3,
		"cost": 320,
		"requiredTech": "Dynamite",
		"upgradesTo": "Rocket Artillery",
		"uniques": ["+[200]% Strength vs [City]","No defensive terrain bonus",
			"Must set up to ranged attack","Limited Visibility","Ranged attacks may be performed over obstacles"],
		"attackSound": "artillery"
	},

	// Modern era

	{
		"name": "Submarine",
		"unitType": "Submarine",
		"movement": 5,
		"strength": 35,
		"rangedStrength": 60,
		"cost": 325,
		"requiredTech": "Refrigeration",
		"upgradesTo": "Nuclear Submarine",
		"uniques": ["+[75]% Strength when attacking", "Can only attack [Water] tiles"],
		"attackSound": "torpedo"
	},
	{
		"name": "Great War Infantry",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 50,
		"cost": 320,
		"requiredTech": "Replaceable Parts",
		"upgradesTo": "Infantry",
		"obsoleteTech": "Plastics",
		"attackSound": "shot"
	},
	{
		"name": "Foreign Legion",
		"unitType": "Gunpowder",
		"replaces": "Great War Infantry",
		"uniqueTo": "France",
		"movement": 2,
		"strength": 50,
		"cost": 320,
		"requiredTech": "Replaceable Parts",
		"upgradesTo": "Infantry",
		"obsoleteTech": "Plastics",
		"uniques": ["+[20]% Strength in [Foreign Land]"],
		"attackSound": "shot"
	},
	{
		"name": "Triplane",
		"unitType": "Fighter",
		"movement": 1,
		"strength": 35,
		"rangedStrength": 35,
		"range": 5,
		"interceptRange": 5,
		"cost": 325,
		"requiredTech": "Flight",
		"requiredResource": "Oil",
		"upgradesTo": "Fighter",
		"obsoleteTech": "Radar",
		"uniques": ["[50]% chance to intercept air attacks", "+[150]% Strength vs [Bomber]", "+[150]% Strength vs [Helicopter]"],
		"attackSound": "machinegun"
	},
	{
		"name": "Great War Bomber",
		"unitType": "Bomber",
		"movement": 1,
		"strength": 50,
		"rangedStrength": 50,
		"range": 6,
		"cost": 325,
		"requiredTech": "Flight",
		"requiredResource": "Oil",
		"upgradesTo": "Bomber",
		"obsoleteTech": "Radar",
		"attackSound": "bombing"
	},
	{
		"name": "Infantry",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 70,
		"cost": 375,
		"requiredTech": "Plastics",
		"upgradesTo": "Mechanized Infantry",
		"obsoleteTech": "Mobile Tactics",
		"attackSound": "shot"
	},
	{
		"name": "Carrier",
		"unitType": "Aircraft Carrier",
		"movement": 5,
		"strength": 40,
		"cost": 375,
		"requiredTech": "Electronics",
		"uniques": ["Cannot attack", "Can carry [2] [Aircraft] units"]
	},
	{
		"name": "Battleship",
		"unitType": "Ranged Water",
		"movement": 5,
		"strength": 55,
		"rangedStrength": 55,
		"range": 3,
		"cost": 375,
		"requiredResource": "Oil",
		"requiredTech": "Electronics",
		"uniques": ["Ranged attacks may be performed over obstacles"],
		"attackSound": "shipguns"
		// Does not actually upgrade to Missile Cruisers
	},
	{
		"name": "Machine Gun",
		"unitType": "Ranged Gunpowder",
		"range": 1,
		"movement": 2,
		"strength": 60,
		"rangedStrength": 60,
		"cost": 350,
		"requiredTech": "Ballistics",
		"upgradesTo": "Mechanized Infantry",
		"attackSound": "machinegun"
		// Upgrades to Bazooka in BNW
	},
	{
		"name": "Anti-Aircraft Gun",
		"unitType": "Gunpowder",
		"movement": 2,
		"interceptRange": 2,
		"strength": 50,
		"cost": 375,
		"requiredTech": "Ballistics",
		"upgradesTo": "Mobile SAM",
		"obsoleteTech": "Rocketry",
		"uniques": ["[100]% chance to intercept air attacks", "+[150]% Strength vs [air units]", "+[150]% Strength vs [Helicopter]"],
		"attackSound": "machinegun"
	},
	{
		"name": "Landship",
		"unitType": "Armored",
		"movement": 4,
		"strength": 60,
		"cost": 350,
		"requiredTech": "Combustion",
		"requiredResource": "Oil",
		"upgradesTo": "Tank",
		"obsoleteTech": "Combined Arms",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"attackSound": "tankshot"
	},
	{
		"name": "Destroyer",
		"unitType": "Melee Water",
		"movement": 6,
		"strength": 55,
		"interceptRange": 2,
		"cost": 375,
		"requiredTech": "Combustion",
		"uniques": ["Can see invisible [Submarine] units", "[40]% chance to intercept air attacks",
			"May withdraw before melee ([80]%)", "+[100]% Strength vs [submarine units]"],
		"attackSound": "shipguns"
	},

	// Atomic Era

	{
		"name": "Marine",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 65,
		"cost": 400,
		"requiredTech": "Pharmaceuticals",
		"promotions": ["Amphibious"],
		"uniques": ["Normal vision when embarked", "Defense bonus when embarked"],
		"attackSound": "shot"
	},
	{
		"name": "Fighter",
		"unitType": "Fighter",
		"movement": 1,
		"strength": 45,
		"rangedStrength": 45,
		"range": 8,
		"interceptRange": 8,
		"cost": 375,
		"requiredTech": "Radar",
		"requiredResource": "Oil",
		"upgradesTo": "Jet Fighter",
		"uniques": ["[100]% chance to intercept air attacks", "+[150]% Strength vs [Bomber]", "+[150]% Strength vs [Helicopter]"],
		"attackSound": "machinegun"
	},
	{
		"name": "Zero",
		"unitType": "Fighter",
		"replaces": "Fighter",
		"uniqueTo": "Japan",
		"movement": 1,
		"strength": 45,
		"rangedStrength": 45,
		"range": 8,
		"interceptRange": 8,
		"cost": 375,
		"requiredTech": "Radar",
		"upgradesTo": "Jet Fighter",
		"uniques": ["[100]% chance to intercept air attacks", "+[150]% Strength vs [Bomber]", "+[150]% Strength vs [Helicopter]",
			"+[33]% Strength vs [Fighter]"],
		"attackSound": "machinegun"
	},
	{
		"name": "Bomber",
		"unitType": "Bomber",
		"movement": 1,
		"strength": 65,
		"rangedStrength": 65,
		"range": 10,
		"cost": 375,
		"requiredTech": "Radar",
		"requiredResource": "Oil",
		"upgradesTo": "Stealth Bomber",
		"attackSound": "bombing"
	},
	{
		"name": "B17",
		"unitType": "Bomber",
		"replaces": "Bomber",
		"uniqueTo": "America",
		"movement": 1,
		"strength": 70,
		"rangedStrength": 70,
		"range": 10,
		"cost": 375,
		"requiredTech": "Radar",
		"requiredResource": "Oil",
		"promotions": ["Evasion", "Siege I"],
		"upgradesTo": "Stealth Bomber",
		"attackSound": "bombing"
	},
	{
		"name": "Paratrooper",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 65,
		"cost": 375,
		"requiredTech": "Radar",
		"uniques": ["May Paradrop up to [5] tiles from inside friendly territory"],
		"attackSound": "shot"
		// upgradesTo "XCOM Squad", "No Movement Cost to Pillage" in BNW
	},
	{
		"name": "Tank",
		"unitType": "Armored",
		"movement": 5,
		"strength": 70,
		"cost": 375,
		"requiredTech": "Combined Arms",
		"requiredResource": "Oil",
		"upgradesTo": "Modern Armor",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"attackSound": "tankshot"
	},
	{
		"name": "Panzer",
		"unitType": "Armored",
		"uniqueTo": "Germany",
		"replaces": "Tank",
		"movement": 6,
		"strength": 80,
		"cost": 375,
		"requiredTech": "Combined Arms",
		"requiredResource": "Oil",
		"upgradesTo": "Modern Armor",
		"uniques": ["Can move after attacking","No defensive terrain bonus"],
		"attackSound": "tankshot"
		//German unique unit, stronger than Tank
	},
	{
		"name": "Anti-Tank Gun",
		"unitType": "Gunpowder",
		"movement": 2,
		"strength": 50,
		"cost": 300,
		"requiredTech": "Combined Arms",
		"upgradesTo": "Helicopter Gunship",
		"uniques": ["+[100]% Strength vs [Armored]"],
		"attackSound": "machinegun"
	},
	{
		"name": "Atomic Bomb",
		"unitType": "Atomic Bomber",
		"movement": 1,
		"strength": 150,
		"rangedStrength": 150,
		"range": 10,
		"cost": 600,
		"requiredTech": "Nuclear Fission",
		"requiredResource": "Uranium",
		"promotions" : ["Evasion"],
		"uniques": ["Nuclear weapon of Strength [1]", "Requires [Manhattan Project]", "Self-destructs when attacking",
			"Blast radius [2]"],
		"attackSound": "nuke"
		// Plane rather than a missile - can be based in city or Carrier only.
		// Can be intercepted, but must die for it not to take effect.
	},
	{
		"name": "Rocket Artillery",
		"unitType": "Siege",
		"movement": 2,
		"strength": 45,
		"rangedStrength": 60,
		"range": 3,
		"cost": 425,
		"requiredTech": "Rocketry",
		"requiredResource": "Aluminum",
		"uniques": ["+[200]% Strength vs [City]","No defensive terrain bonus",
			"Limited Visibility","Ranged attacks may be performed over obstacles"],
		"attackSound": "artillery"
	},
	{
		"name": "Mobile SAM",
		"unitType": "Gunpowder",
		"movement": 3,
		"interceptRange": 2,
		"strength": 65,
		"cost": 425,
		"requiredTech": "Rocketry",
		"uniques": ["[100]% chance to intercept air attacks", "+[150]% Strength vs [air units]", "+[150]% Strength vs [Helicopter]"],
		"attackSound": "missile"
	},
	{
		"name": "Guided Missile",
		"unitType": "Missile",
		"movement": 1,
		"strength": 60,
		"rangedStrength": 60,
		"range": 8,
		"cost": 150,
		"requiredTech": "Advanced Ballistics",
		"attackSound": "missile"
	},
	{
		"name": "Nuclear Missile",
		"unitType": "Missile",
		"movement": 1,
		"strength": 300,
		"rangedStrength": 300,
		"range": 12,
		"cost": 1000,
		"requiredTech": "Advanced Ballistics",
		"uniques": ["Nuclear weapon of Strength [2]", "Requires [Manhattan Project]",
			"Blast radius [2]", "Consumes [2] [Uranium]"],
		"attackSound": "nuke"
	},
	{
		// "Hovering unit" unique gives ability to get into impassable tiles - and only that (no vision bonus or flying over ocean)
		// Unit embarks like any other ground unit and has penalty for attacking over river or from embarked state
		"name": "Helicopter Gunship",
		"unitType": "Helicopter",
		"movement": 6,
		"strength": 60,
		"cost": 425,
		"requiredTech": "Computers",
		"requiredResource": "Aluminum",
		"uniques": ["+[100]% Strength vs [Armored]", "No defensive terrain bonus", "Can move after attacking",
			"All tiles cost 1 movement", "Ignores Zone of Control", "Unable to capture cities"],
		"attackSound": "machinegun"
	},

	// Information Era
	{
		"name": "Nuclear Submarine",
		"unitType": "Submarine",
		"movement": 6,
		"strength": 50,
		"range": 3,
		"rangedStrength": 85,
		"cost": 425,
		"requiredTech": "Telecommunications",
		"uniques": ["+[75]% Strength when attacking", "Can only attack [Water] tiles", "[+1] Visibility Range", "Can carry [2] [Missile] units"],
		"attackSound": "torpedo"
	},
	{
		"name": "Mechanized Infantry",
		"unitType": "Gunpowder",
		"movement": 3,
		"strength": 90,
		"cost": 375,
		"requiredTech": "Mobile Tactics",
		"attackSound": "tankshot"
	},
	{
		"name": "Missile Cruiser",
		"unitType": "Ranged Water",
		"movement": 7,
		"strength": 80,
		"rangedStrength": 100,
		"range": 3,
		"interceptRange": 2,
		"cost": 425,
		"requiredTech": "Robotics",
		"uniques": ["[100]% chance to intercept air attacks", "Can see invisible [Submarine] units",
			"Ranged attacks may be performed over obstacles", "Can carry [3] [Missile] units",
			"+[100]% Strength vs [submarine units]"],
		"attackSound": "shipguns"
	},
	{
		"name": "Modern Armor",
		"unitType": "Armored",
		"movement": 5,
		"strength": 100,
		"cost": 425,
		"requiredTech": "Lasers",
		"requiredResource": "Aluminum",
		"upgradesTo": "Giant Death Robot",
		"uniques": ["Can move after attacking", "No defensive terrain bonus"],
		"attackSound": "tankshot"
	},
	{
		"name": "Jet Fighter",
		"unitType": "Fighter",
		"movement": 1,
		"strength": 75,
		"rangedStrength": 75,
		"range": 10,
		"interceptRange": 10,
		"cost": 425,
		"requiredTech": "Lasers",
		"requiredResource": "Aluminum",
		"uniques": ["[100]% chance to intercept air attacks", "+[150]% Strength vs [Bomber]", "+[150]% Strength vs [Helicopter]"],
		"attackSound": "jetgun"
	},
	{
		"name": "Giant Death Robot",
		"unitType": "Armored",
		"movement": 5,
		"strength": 150,
		"cost": 425,
		"requiredTech": "Nuclear Fusion",
		"requiredResource": "Uranium",
		"uniques": ["Can move after attacking", "No defensive terrain bonus"],
		"attackSound": "gdrAttack"
	},
	{
		"name": "Stealth Bomber",
		"unitType": "Bomber",
		"movement": 2,
		"strength": 85,
		"rangedStrength": 85,
		"range": 20,
		"cost": 425,
		"requiredTech": "Stealth",
		"requiredResource": "Aluminum",
		"uniques": ["Damage taken from interception reduced by [100]%", "Cannot be carried by [Carrier] units", "6 tiles in every direction always visible"],
		"attackSound": "bombing"
	},

	/* Great people */

	{
		"name": "Great Artist",
		"unitType": "Civilian",
		"uniques": ["Can start an [8]-turn golden age", "Can construct [Landmark]", "Great Person - [Culture]", "Unbuildable", "Uncapturable"],
		"movement": 2
	},
	{
		"name": "Great Scientist",
		"unitType": "Civilian",
		"uniques": ["Can hurry technology research", "Can construct [Academy]", "Great Person - [Science]", "Unbuildable", "Uncapturable"],
		"movement": 2
	},
	{
		"name": "Great Merchant",
		"unitType": "Civilian",
		"uniques": ["Can undertake a trade mission with City-State, giving a large sum of gold and [30] Influence",
			"Can construct [Customs house]", "Great Person - [Gold]", "Unbuildable", "Uncapturable"],
		"movement": 2
	},
	{
		"name": "Great Engineer",
		"unitType": "Civilian",
		"uniques": ["Can speed up construction of a building", "Can construct [Manufactory]", "Great Person - [Production]", "Unbuildable", "Uncapturable"],
		"movement": 2
	},
	{
		"name": "Great Prophet",
		"unitType": "Civilian",
		"uniques": ["Can construct [Holy site] if it hasn't used other actions yet", "Can [Spread Religion] [4] times",
			"Removes other religions when spreading religion", "May found a religion", "May enhance a religion", 
			"May enter foreign tiles without open borders", "[-1] Visibility Range", "Great Person - [Faith]", 
			"Unbuildable", "Religious Unit", "Hidden when religion is disabled", 
			"Takes your religion over the one in their birth city"],
		"movement": 2,
		"religiousStrength": 1000
	},
	{
		"name": "Great General",
		"unitType": "Civilian",
		"uniques": ["Can start an [8]-turn golden age", "Bonus for units in 2 tile radius 15%", "Can construct [Citadel]",
			"Great Person - [War]", "Unbuildable", "Uncapturable"],
		"movement": 2
	},
	{
		"name": "Khan",
		"unitType": "Civilian",
		"uniqueTo": "Mongolia",
		"replaces": "Great General",
		"uniques": ["Can start an [8]-turn golden age","Bonus for units in 2 tile radius 15%",
			"All adjacent units heal [+15] HP when healing", "[+15] HP when healing", "Can construct [Citadel]", "Great Person - [War]", "Unbuildable", "Uncapturable"],
		"movement": 5
	},

	/* Religious units */

	{
		"name": "Missionary",
		"unitType": "Civilian",
		"uniques": ["Can [Spread Religion] [2] times", "May enter foreign tiles without open borders, but loses [250] religious strength each turn it ends there",
			"Can be purchased with [Faith] [in all cities in which the majority religion is a major religion]", 
			"[-1] Visibility Range", "Unbuildable", "Religious Unit", "Hidden when religion is disabled"],
		"movement": 4,
		"religiousStrength": 1000
	},
	{
		"name": "Inquisitor",
		"unitType": "Civilian",
		"uniques": ["Prevents spreading of religion to the city it is next to",
			"Can [Remove Foreign religions from your own cities] [1] times",
			"Can be purchased with [Faith] [in all cities in which the majority religion is an enhanced religion]",
			"[+1] Visibility Range", "Hidden when religion is disabled", "Unbuildable", "Religious Unit"
		],
		"movement": 3,
	}

	/* Spaceship Parts */
	/*
	// Must be transported to the Capital for launch.
	// Can be destroyed by any hostile military unit walking in their tile.
	{
		"name": "SS Booster",
		"unitType": "Civilian",
		"movement": 2,
		"cost": 500,
		"requiredTech": "Advanced Ballistics",
		"requiredResource": "Aluminum",
		"uniques": ["Spaceship part", "Cannot be purchased", "Requires [Apollo Program]"]
		// costs 750 in G&K, 1500 in BNW
	},
	{
		"name": "SS Cockpit",
		"unitType": "Civilian",
		"movement": 2,
		"cost": 750,
		"requiredTech": "Satellites",
		"requiredResource": "Aluminum",
		"uniques": ["Spaceship part", "Cannot be purchased", "Requires [Apollo Program]"]
		// costs 1500 in BNW
	},
	{
		"name": "SS Engine",
		"unitType": "Civilian",
		"movement": 2,
		"cost": 750,
		"requiredTech": "Particle Physics",
		"requiredResource": "Aluminum",
		"uniques": ["Spaceship part", "Cannot be purchased", "Requires [Apollo Program]"]
		// costs 1500 in BNW
	},
	{
		"name": "SS Stasis Chamber",
		"unitType": "Civilian",
		"movement": 2,
		"cost": 750,
		"requiredTech": "Nanotechnology",
		"requiredResource": "Aluminum",
		"uniques": ["Spaceship part", "Cannot be purchased", "Requires [Apollo Program]"]
		// costs 1500 in BNW
	}
	*/
]
